zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_generator_v3.c
/***************************************************************************//**
* \file cy_capsense_generator_v3.c
* \version 10.0.0
*
* \brief
* This file contains the source of functions common for register map
* generator module.
*
********************************************************************************
* \copyright
* (c) 2020-2026, Infineon Technologies AG, or an affiliate of Infineon
* Technologies AG. All rights reserved.
* This software, associated documentation and materials ("Software") is
* owned by Infineon Technologies AG or one of its affiliates ("Infineon")
* and is protected by and subject to worldwide patent protection, worldwide
* copyright laws, and international treaty provisions. Therefore, you may use
* this Software only as provided in the license agreement accompanying the
* software package from which you obtained this Software. If no license
* agreement applies, then any use, reproduction, modification, translation, or
* compilation of this Software is prohibited without the express written
* permission of Infineon.
*
* Disclaimer: UNLESS OTHERWISE EXPRESSLY AGREED WITH INFINEON, THIS SOFTWARE
* IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
* INCLUDING, BUT NOT LIMITED TO, ALL WARRANTIES OF NON-INFRINGEMENT OF
* THIRD-PARTY RIGHTS AND IMPLIED WARRANTIES SUCH AS WARRANTIES OF FITNESS FOR A
* SPECIFIC USE/PURPOSE OR MERCHANTABILITY.
* Infineon reserves the right to make changes to the Software without notice.
* You are responsible for properly designing, programming, and testing the
* functionality and safety of your intended application of the Software, as
* well as complying with any legal requirements related to its use. Infineon
* does not guarantee that the Software will be free from intrusion, data theft
* or loss, or other breaches ("Security Breaches"), and Infineon shall have
* no liability arising out of any Security Breaches. Unless otherwise
* explicitly approved by Infineon, the Software may not be used in any
* application where a failure of the Product or any consequences of the use
* thereof can reasonably be expected to result in personal injury.
*******************************************************************************/


#include <string.h>
#include "cycfg_capsense_defines.h"
#include "cycfg_peripherals.h"
#include "cy_capsense_common.h"
#include "cy_capsense_structure.h"
#include "cy_capsense_sensing_v3.h"
#include "cy_capsense_generator_v3.h"
#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
    #include "cy_msc.h"
#endif

#if (defined(CY_IP_M0S8MSCV3))

/*******************************************************************************
* Internal function prototypes
*******************************************************************************/
#if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
static void Cy_CapSense_GenerateCtrlMuxSwControl(
                uint32_t chIndex,
                cy_stc_capsense_context_t * context);
#endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) */

#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
static void Cy_CapSense_ApplyShieldConfig(
                cy_stc_msc_mode_config_t * ptrBaseCfgMode,
                const cy_stc_capsense_context_t * context);
#endif

static void Cy_CapSense_ConfigSensorClock(
                uint32_t scanSlot,
                uint32_t * ptrSensorCfg,
                const cy_stc_capsense_context_t * context);

cy_capsense_status_t Cy_CapSense_GenerateSensorConfigValid(
                uint32_t scanSlot,
                uint32_t * ptrSensorCfg,
                cy_stc_capsense_context_t * context);

uint32_t Cy_CapSense_AdjustSnsClkDivider(
                uint8_t snsMethod,
                uint8_t snsClkSource,
                uint16_t snsClkDivider);


/*******************************************************************************
* Function Name: Cy_CapSense_GenerateBaseConfig
****************************************************************************//**
*
* Generates the configuration for all registers that have to be configured
* one-time to initialize the MSC block.
*
* \param chIndex
* The desired channel index.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_GenerateBaseConfig(
                uint32_t chIndex,
                cy_stc_capsense_context_t * context)
{
    uint32_t i;
    uint32_t snsMethod;
    uint32_t idCounter;
    uint8_t * ptrMapping;
    uint32_t cdacDitherEnabled;
    uint32_t snsMethodInternal;
    cy_stc_capsense_internal_context_t * ptrIntrCxt = context->ptrInternalContext;

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
        cy_stc_msc_mode_config_t * ptrBaseCfgMode;
    #endif

    const cy_stc_msc_base_config_t cy_capsense_smTemplate = CY_CAPSENSE_SENSING_METHOD_BASE_TEMPLATE;

    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_SUCCESS;

    cy_stc_msc_base_config_t * ptrBaseCfg;
    const cy_stc_msc_base_config_t * ptrTemplateCfg;
    const cy_stc_capsense_channel_config_t * ptrChConfig = &context->ptrCommonConfig->ptrChConfig[chIndex];

    /*
     * BASE CONFIGURATION
     */
    ptrBaseCfg = &context->ptrBaseFrameContext[chIndex];
    ptrTemplateCfg = &cy_capsense_smTemplate;

    /* Copies template of a base config */
    ptrBaseCfg->ctl = ptrTemplateCfg->ctl;
    if (context->ptrInternalContext->modClk > 1u)
    {
        ptrBaseCfg->ctl &= (~MSC_CTL_CLK_MSC_RATIO_Msk);
    }
    else
    {
        ptrBaseCfg->ctl |= MSC_CTL_CLK_MSC_RATIO_Msk;
    }

    ptrBaseCfg->spare = ptrTemplateCfg->spare;
    ptrBaseCfg->scanCtl1 = ptrTemplateCfg->scanCtl1;
    ptrBaseCfg->scanCtl2 = ptrTemplateCfg->scanCtl2;
    ptrBaseCfg->initCtl1 = ptrTemplateCfg->initCtl1;
    ptrBaseCfg->initCtl2 = ptrTemplateCfg->initCtl2;
    ptrBaseCfg->initCtl3 = ptrTemplateCfg->initCtl3;
    ptrBaseCfg->initCtl4 = ptrTemplateCfg->initCtl4;
    ptrBaseCfg->senseDutyCtl = ptrTemplateCfg->senseDutyCtl;
    ptrBaseCfg->sensePeriodCtl = ptrTemplateCfg->sensePeriodCtl;
    ptrBaseCfg->filterCtl = ptrTemplateCfg->filterCtl;
    ptrBaseCfg->ccompCdacCtl = ptrTemplateCfg->ccompCdacCtl;
    ptrBaseCfg->ditherCdacCtl = ptrTemplateCfg->ditherCdacCtl;
    ptrBaseCfg->cswCtl = ptrTemplateCfg->cswCtl;
    ptrBaseCfg->swSelGpio = ptrTemplateCfg->swSelGpio;
    ptrBaseCfg->swSelCdacRe = ptrTemplateCfg->swSelCdacRe;
    ptrBaseCfg->swSelCdacCo = ptrTemplateCfg->swSelCdacCo;
    ptrBaseCfg->swSelCdacCf = ptrTemplateCfg->swSelCdacCf;
    ptrBaseCfg->swSelCmod1 = ptrTemplateCfg->swSelCmod1;
    ptrBaseCfg->swSelCmod2 = ptrTemplateCfg->swSelCmod2;
    ptrBaseCfg->swSelCmod3 = ptrTemplateCfg->swSelCmod3;
    ptrBaseCfg->swSelCmod4 = ptrTemplateCfg->swSelCmod4;

