zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_generator_v3.c
    #if (defined(CY_DEVICE_PSOC4AS4))
        if (CY_CAPSENSE_CMOD1PADD_PIN == ptrChConfig->pinCmod1)
        {
            /* Second Cmod pair in use. Clears the first pair */
            ptrBaseCfg->swSelCmod1 = 0u;
            ptrBaseCfg->swSelCmod2 = 0u;
        }
        else
        {
            ptrBaseCfg->swSelCmod3 = 0u;
            ptrBaseCfg->swSelCmod4 = 0u;
        }
    #else
        /* PSOC4-HVMS-128K Devices */
        if (CY_CAPSENSE_CMOD1PADD_PIN == ptrChConfig->pinCmod1)
        {
            /* First Cmod pair in use. Clears second pair */
            ptrBaseCfg->swSelCmod3 = 0u;
            ptrBaseCfg->swSelCmod4 = 0u;
        }
        else 
        {
            ptrBaseCfg->swSelCmod1 = 0u;
            ptrBaseCfg->swSelCmod2 = 0u;
        }
    #endif

    ptrBaseCfg->obsCtl = ptrTemplateCfg->obsCtl;
    ptrBaseCfg->intr = ptrTemplateCfg->intr;
    ptrBaseCfg->intrSet = ptrTemplateCfg->intrSet;
    ptrBaseCfg->intrMask = ptrTemplateCfg->intrMask;

    /* Set the scanning mode */
    #if (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE)
        ptrBaseCfg->ctl |= (uint32_t)CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN << MSC_CTL_OPERATING_MODE_Pos;
    #endif /* (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE) */

    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
        ptrBaseCfg->swSelGpio = 0u;
    #endif

    /* Frame is not started */
    ptrBaseCfg->frameCmd = 0x00u;

    /* Clear Structures */
    (void)memset(&ptrBaseCfg->sensorConfig, 0, sizeof(cy_stc_msc_sensor_config_t));
    (void)memset(&ptrBaseCfg->swSelCsw[0u], 0, CY_MSC_CSW_NUM * CY_CAPSENSE_BYTE_IN_32_BIT);
    (void)memset(&ptrBaseCfg->mode, 0, sizeof(cy_stc_msc_mode_config_t) * CY_MSC_MODES_NUM);

    /*
     * MODE CONFIGURATION
     */
    idCounter = 0u;
    ptrMapping = &ptrIntrCxt->mapSenseMethod[0u];
    for (i = 0u; i < CY_CAPSENSE_REG_MODE_NUMBER; i++)
    {
        ptrMapping[i] = CY_CAPSENSE_REG_MODE_UNDEFINED;
    }
    if (0u == context->ptrCommonConfig->numWd)
    {
        capStatus |= CY_CAPSENSE_STATUS_BAD_CONFIG;
    }
    /* For each widget */
    for (i = 0u; i < context->ptrCommonConfig->numWd; i++)
    {
        cdacDitherEnabled = context->ptrWdContext[i].cdacDitherEn;

        /* Calculate REG_MODE value */
        snsMethod = context->ptrWdConfig[i].senseMethod;
        snsMethodInternal = snsMethod - 1u;

        if (CY_CAPSENSE_ENABLE == cdacDitherEnabled)
        {
            /* Shift sense mode to cdac dither enabled modes */
            snsMethodInternal += CY_CAPSENSE_REG_MODE_DITHERING;
        }

        /* If a method is a new method then register the method */
        if (ptrMapping[snsMethodInternal] == CY_CAPSENSE_REG_MODE_UNDEFINED)
        {
            if (CY_MSC_SENSE_MODE_NUMBER < idCounter)
            {
                capStatus |= CY_CAPSENSE_STATUS_CONFIG_OVERFLOW;
                break;
            }
            else
            {
                ptrMapping[snsMethodInternal] = (uint8_t)idCounter;
                ptrBaseCfg->mode[idCounter] = ptrTemplateCfg->mode[snsMethodInternal];

                #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
                        if (CY_CAPSENSE_CSX_GROUP == snsMethod)
                        {
                            ptrBaseCfg->mode[idCounter].senseDutyCtl = CY_CAPSENSE_FW_CSX_AMUX_MODE_SENSE_DUTY_CTL_VALUE;
                        }
                    #endif
                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
                        if (CY_CAPSENSE_CSD_GROUP == snsMethod)
                        {
                            ptrBaseCfg->mode[idCounter].senseDutyCtl = 0u;
                        }
                    #endif
                #endif

                #if (defined(CY_DEVICE_PSOC4AS4))
                    if (CY_CAPSENSE_CMOD1PADD_PIN == ptrChConfig->pinCmod1)
                    {
                        /* Second Cmod pair in use */
                        ptrBaseCfg->mode[idCounter].swSelComp &= (~MSC_MODE_SW_SEL_COMP_CPCS1_Msk);
                        ptrBaseCfg->mode[idCounter].swSelComp &= (~MSC_MODE_SW_SEL_COMP_CMCS2_Msk);
                        ptrBaseCfg->mode[idCounter].swSelComp |= MSC_MODE_SW_SEL_COMP_CPCS3_Msk;
                        ptrBaseCfg->mode[idCounter].swSelComp |= MSC_MODE_SW_SEL_COMP_CMCS4_Msk;
                        ptrBaseCfg->mode[idCounter].swSelSh &= (~MSC_MODE_SW_SEL_SH_C1SHG_Msk);
                        ptrBaseCfg->mode[idCounter].swSelSh |= MSC_MODE_SW_SEL_SH_C3SHG_Msk;
                    }
                #else
                    /* PSOC4-HVMS-128K Devices */
                    if (CY_CAPSENSE_CMOD1PADD_PIN == ptrChConfig->pinCmod1)
                    {
                        /* First Cmod pair in use. Do nothing, initialized by template. */
                    }
                    else 
                    {
                        ptrBaseCfg->mode[idCounter].swSelComp &= (~MSC_MODE_SW_SEL_COMP_CPCS1_Msk);
                        ptrBaseCfg->mode[idCounter].swSelComp &= (~MSC_MODE_SW_SEL_COMP_CMCS2_Msk);
                        ptrBaseCfg->mode[idCounter].swSelComp |= MSC_MODE_SW_SEL_COMP_CPCS3_Msk;
                        ptrBaseCfg->mode[idCounter].swSelComp |= MSC_MODE_SW_SEL_COMP_CMCS4_Msk;
                        ptrBaseCfg->mode[idCounter].swSelSh &= (~MSC_MODE_SW_SEL_SH_C1SHG_Msk);
                        ptrBaseCfg->mode[idCounter].swSelSh |= MSC_MODE_SW_SEL_SH_C3SHG_Msk;
                    }
                #endif


                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
                    if (CY_CAPSENSE_CSX_GROUP == snsMethod)
                    {
                        #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                            ptrBaseCfg->mode[idCounter].swSelTop = CY_CAPSENSE_CSX_FW_AMUX_MODE_SW_SEL_TOP_VALUE;
                        #else
                            ptrBaseCfg->mode[idCounter].swSelTop = CY_CAPSENSE_CSX_FW_CTLMUX_MODE_SW_SEL_TOP_VALUE;
                        #endif

                        if (CY_CAPSENSE_SNS_CONNECTION_VDDA_BY_2 == ptrIntrCxt->intrCsxInactSnsConn)
                        {
                            /* Close the reference to filter switch */
                            ptrBaseCfg->mode[idCounter].swSelTop |= MSC_MODE_SW_SEL_TOP_RMF_Msk;
                            #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                                ptrBaseCfg->mode[idCounter].swSelSh = CY_CAPSENSE_FW_CSX_VDDA2_AMUX_MODE_SW_SEL_SH_VALUE;
                            #else
                                ptrBaseCfg->mode[idCounter].swSelSh = CY_CAPSENSE_FW_CSX_VDDA2_CTLMUX_MODE_SW_SEL_SH_VALUE;
                            #endif
                        }
                    }
                #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) */

                idCounter++;
            }
        }
    }
    ptrIntrCxt->numSenseMethod = (uint8_t)idCounter;

