zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_generator_v3.c
    /*
     * PINS CONFIGURATION
     */
    for (i = 0u; i < CY_CAPSENSE_CTRLMUX_PIN_STATE_NUMBER; i++)
    {
        ptrBaseCfg->swSelCswFunc[i] = ptrTemplateCfg->swSelCswFunc[i];
    }

    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) &&\
         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN))
        if (CY_CAPSENSE_SHIELD_PASSIVE == context->ptrCommonConfig->csdShieldMode)
        {
            ptrBaseCfg->swSelCswFunc[CY_CAPSENSE_CTRLMUX_PIN_STATE_SHIELD] =
                    CY_CAPSENSE_FW_SHIELD_PASSIVE_CTRLMUX_REG_SW_SEL_CSW_VALUE;
        }
    #endif

    #if ((CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE) && \
         (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD))
        /* Configure SW_SEL_CSW_FUNC entries for External Cref function codes */
        ptrBaseCfg->swSelCswFunc[CY_CAPSENSE_CTRLMUX_PIN_STATE_EXT_CREF0] =
                CY_CAPSENSE_EXT_CREF0_SW_SEL_CSW_VALUE;
        ptrBaseCfg->swSelCswFunc[CY_CAPSENSE_CTRLMUX_PIN_STATE_EXT_CREF1] =
                CY_CAPSENSE_EXT_CREF1_SW_SEL_CSW_VALUE;
    #endif /* ((CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE) && \
             (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)) */

    /*
     * CONFIGURATION FROM CAPSENSE&trade; DATA STRUCTURE
     */

    /* Initialize interrupts for all enabled MSC channels */
    #if (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE)
        ptrBaseCfg->intrMask |= MSC_INTR_MASK_FRAME_Msk;
    #else
        ptrBaseCfg->intrMask |= MSC_INTR_MASK_SCAN_Msk;
    #endif /* (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE) */
    (void)ptrBaseCfg->intrMask;

    /* Shielding is available in CSD only */
    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) &&\
         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN))
        if (CY_CAPSENSE_REG_MODE_UNDEFINED != ptrMapping[CY_CAPSENSE_REG_MODE_CSD])
        {
            ptrBaseCfgMode = &ptrBaseCfg->mode[ptrMapping[CY_CAPSENSE_REG_MODE_CSD]];
            Cy_CapSense_ApplyShieldConfig(ptrBaseCfgMode, context);
        }

        if (CY_CAPSENSE_REG_MODE_UNDEFINED != ptrMapping[CY_CAPSENSE_REG_MODE_CSD_DITHERING])
        {
            ptrBaseCfgMode = &ptrBaseCfg->mode[ptrMapping[CY_CAPSENSE_REG_MODE_CSD_DITHERING]];
            Cy_CapSense_ApplyShieldConfig(ptrBaseCfgMode, context);
        }
    #endif

    /* Generating the common configuration for the Compensation CDAC */
    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_COMP_USAGE) || \
         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_COMP_USAGE))
        ptrBaseCfg->ccompCdacCtl |= (uint32_t)ptrIntrCxt->proOffsetCdacComp << MSC_CCOMP_CDAC_CTL_SEL_CO_PRO_OFFSET_Pos;
    #else
        ptrBaseCfg->swSelCdacCo = 0u;
    #endif

    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CIC2_FILTER_EN)
        /* Generating the common configuration for the CIC2 Filter */
        ptrBaseCfg->filterCtl = 0x01uL << MSC_FILTER_CTL_FILTER_MODE_Pos;
    #endif

    /* Generating the common configuration for the control mux switch control */
    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
        Cy_CapSense_GenerateCtrlMuxSwControl(chIndex, context);
    #endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) */

    /* Generating the common configuration for the dithering CapDAC */
    ptrBaseCfg->ditherCdacCtl = (uint32_t)context->ptrInternalContext->cdacDitherSeed |
                                ((uint32_t)context->ptrInternalContext->cdacDitherPoly << MSC_DITHER_CDAC_CTL_LFSR_POLY_FL_Pos);

    /* Configures synchronization signals */

    /* Sync_Clock */
    ptrBaseCfg->ctl &= ~MSC_CTL_CLK_SYNC_EN_Msk;
    /* If SYNC_CLK is enabled, generates CLK_SYNC_EN only for the Master channel */
    if ((((uint32_t)context->ptrCommonConfig->masterChannelId) == (chIndex + context->ptrCommonConfig->channelOffset)) &&
        (CY_CAPSENSE_ENABLE == context->ptrCommonConfig->syncClockEn))
    {
        ptrBaseCfg->ctl |= (uint32_t)context->ptrCommonConfig->syncClockEn << MSC_CTL_CLK_SYNC_EN_Pos;
    }
    /* Frame Start */
    ptrBaseCfg->ctl &= ~MSC_CTL_EXT_FRAME_START_EN_Msk;
    /*
     * If EXT_FRAME_START is enabled, generates EXT_FRAME_START_EN for all channels,
     * except of the Master channel which is generating FRAME_START for all another channels
     */
    if ((((uint32_t)context->ptrCommonConfig->masterChannelId) == (chIndex + context->ptrCommonConfig->channelOffset)) &&
        (CY_CAPSENSE_ENABLE == context->ptrCommonConfig->syncFrameStartEn))
    {
        ptrBaseCfg->ctl |= (uint32_t)context->ptrCommonConfig->syncFrameStartEn << MSC_CTL_EXT_FRAME_START_EN_Pos;
    }
    /* Generating the multi-channel mode for each channel with updating the sensor control registers */
    if (0u != context->ptrCommonConfig->syncMode)
    {
        context->ptrCommonConfig->ptrChConfig[chIndex].ptrHwBase->SNS_CTL =
                        ((uint32_t)context->ptrCommonConfig->syncMode << MSC_SNS_CTL_MULTI_CH_MODE_Pos);
    }

    /* Generating the common configuration for the clock dithering */
    ptrBaseCfg->sensePeriodCtl = ((uint32_t)context->ptrInternalContext->lfsrPoly << MSC_SENSE_PERIOD_CTL_LFSR_POLY_Pos) |
                                 ((uint32_t)context->ptrInternalContext->lfsrScale << MSC_SENSE_PERIOD_CTL_LFSR_SCALE_Pos);

    /* Generating the common configuration for the number of the auto-resampling cycles and the counter behaviour when the
     * RAW_COUNT exceeds 0xFFFF
     */
    ptrBaseCfg->scanCtl1 &= ~MSC_SCAN_CTL1_NUM_AUTO_RESAMPLE_Msk;
    ptrBaseCfg->scanCtl1 &= ~MSC_SCAN_CTL1_RAW_COUNT_MODE_Msk;
    ptrBaseCfg->scanCtl1 |= (uint32_t)context->ptrCommonConfig->numBadScans << MSC_SCAN_CTL1_NUM_AUTO_RESAMPLE_Pos;
    ptrBaseCfg->scanCtl1 |= (uint32_t)context->ptrCommonConfig->counterMode << MSC_SCAN_CTL1_RAW_COUNT_MODE_Pos;

    /* Generating the common configuration for the number of epilogue cycles */
    ptrBaseCfg->scanCtl2 &= ~MSC_SCAN_CTL2_NUM_EPI_CYCLES_Msk;
    if (0u < ptrIntrCxt->numEpiCycles)
    {
        ptrBaseCfg->scanCtl2 |= (uint32_t)ptrIntrCxt->numEpiCycles << MSC_SCAN_CTL2_NUM_EPI_CYCLES_Pos;
    }
    else
    {
        ptrBaseCfg->scanCtl2 |= (uint32_t)(1uL << MSC_SCAN_CTL2_NUM_EPI_CYCLES_Pos);
    }

    /* Generating the common configuration for the system level chopping */
    ptrBaseCfg->scanCtl2 &= ~MSC_SCAN_CTL2_CHOP_POL_Msk;
    ptrBaseCfg->scanCtl2 |= (uint32_t)context->ptrCommonConfig->chopPolarity << MSC_SCAN_CTL2_CHOP_POL_Pos;

