zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_generator_v3.c
    ptrSensorCfg[CY_CAPSENSE_SNS_SCAN_CTL_INDEX] &= ~(MSC_SNS_SCAN_CTL_INIT_BYPASS_Msk);
    if ((CY_CAPSENSE_ENABLE == context->ptrWdContext[wdIndex].coarseInitBypassEn) &&
        ((scanSlot % CY_CAPSENSE_SLOT_COUNT) != context->ptrWdConfig[wdIndex].firstSlotId)
    #if (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE)
        && (CY_CAPSENSE_CREF_SOURCE_EXTERNAL != context->ptrWdConfig[wdIndex].cRefSource)
    #endif
        )
    {
        ptrSensorCfg[CY_CAPSENSE_SNS_SCAN_CTL_INDEX] |= (MSC_SNS_SCAN_CTL_INIT_BYPASS_Msk);
    }

    ptrSensorCfg[CY_CAPSENSE_SNS_CTL_INDEX] |= (MSC_SNS_CTL_VALID_Msk);
    ptrSensorCfg[CY_CAPSENSE_SNS_CTL_INDEX] |= (MSC_SNS_CTL_START_SCAN_Msk);

   return capStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_GenerateSensorConfig
****************************************************************************//**
*
* Generates configuration to configure registers to
* the scan of the single sensor in the specified slot of the specified channel.
*
* \param chIndex
* The specified channel index.
*
* \param scanSlot
* The specified slot index.
*
* \param ptrSensorCfg
* Specifies the pointer to the sensor configuration to be filled.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_GenerateSensorConfig(
                uint32_t chIndex,
                uint32_t scanSlot,
                uint32_t * ptrSensorCfg,
                cy_stc_capsense_context_t * context)
{
    uint32_t wdIndex;
    uint32_t slotIndex = scanSlot;
    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
        uint32_t nextChIndex;
    #endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD) */
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_BAD_PARAM;

    wdIndex = context->ptrScanSlots[scanSlot].wdId;

    if ((wdIndex == CY_CAPSENSE_SLOT_EMPTY) ||
        (wdIndex == CY_CAPSENSE_SLOT_SHIELD_ONLY) ||
        (wdIndex == CY_CAPSENSE_SLOT_TX_ONLY))
    {
        #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
            if (chIndex == 0u)
            {
                slotIndex = scanSlot + CY_CAPSENSE_SLOT_COUNT;
            }
            else
            {
                slotIndex = scanSlot - CY_CAPSENSE_SLOT_COUNT;
            }
        #else /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD) */
            nextChIndex = ((chIndex == 0u) ? 1u : 0u);
            slotIndex = context->ptrActiveScanSns[chIndex].currentChannelSlotIndex + (nextChIndex * CY_CAPSENSE_SLOT_COUNT);
        #endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)*/
    }
    /* Generate proper config for sensor */
    capStatus = Cy_CapSense_GenerateSensorConfigValid(slotIndex, ptrSensorCfg, context);

    return capStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_GenerateAllSensorConfig
****************************************************************************//**
*
* Generates configuration to configure registers to start
* a scan for all sensors of the specified channel.
*
* \param chId
* Channel ID
*
* \param ptrSensorCfg
* Specifies the pointer to the sensor configuration to be filled.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_GenerateAllSensorConfig(
                uint32_t chId,
                uint32_t * ptrSensorCfg,
                cy_stc_capsense_context_t * context)
{
    uint32_t i = 0u;
    uint32_t scanSlotIndex;
    uint32_t scanSlotIndexValid;
    uint32_t sensorCfgTmp[CY_MSC_6_SNS_REGS] = {0u, 0u, 0u, 0u, 0u, 0u};
    uint32_t * ptrSensorCfgLocal = ptrSensorCfg;

    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
        uint32_t snsMask;
        uint32_t snsMaskInactive = 0u;
        uint32_t snsFuncState;
        uint32_t snsFuncStateSelfCap;
        uint32_t snsFuncStateMutualCap;
        uint32_t snsIndex;
        uint32_t wdIndex;
        uint32_t slotValue;
        uint32_t widgetSenseGroup;
        const cy_stc_capsense_electrode_config_t * eltdPinCfg;

        #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_MULTI_PHASE_TX_ENABLED)
            uint32_t j = 0u;
            uint32_t pattern;
            uint32_t snsMaskNegative;
            uint32_t snsFuncStateNegative;
        #endif

        /* Get mask for all pins in control mux switch registers */
        snsMaskInactive = context->ptrBaseFrameContext[chId].cswCtl;

        #if (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE)
            /* Exclude ext cref pads from inactive mask */
            if (NULL != context->ptrExtCrefPinConfig)
            {
                if ((chId + context->ptrCommonConfig->channelOffset) ==
                    context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF0].chId)
                {
                    snsMaskInactive &= (uint32_t)~(0x01uL << (uint32_t)context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF0].padNumber);
                }
                if ((chId + context->ptrCommonConfig->channelOffset) ==
                    context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF1].chId)
                {
                    snsMaskInactive &= (uint32_t)~(0x01uL << (uint32_t)context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF1].padNumber);
                }
            }
        #endif /* (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE) */

        /* Define mutual cap pin state */
        snsFuncStateMutualCap = CY_CAPSENSE_CTRLMUX_PIN_STATE_GND;
        switch (context->ptrInternalContext->intrCsxInactSnsConn)
        {
            case CY_CAPSENSE_SNS_CONNECTION_HIGHZ:
                snsFuncStateMutualCap = CY_CAPSENSE_CTRLMUX_PIN_STATE_HIGH_Z;
                break;
            #if (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_DISABLE)
            case CY_CAPSENSE_SNS_CONNECTION_VDDA_BY_2:
                snsFuncStateMutualCap = CY_CAPSENSE_CTRLMUX_PIN_STATE_VDDA2;
                break;
            #endif
            default:
                /* No action for other connections */
                break;
        }

        /* Define self cap pin state */
        snsFuncStateSelfCap = CY_CAPSENSE_CTRLMUX_PIN_STATE_GND;
        switch (context->ptrInternalContext->intrCsdInactSnsConn)
        {
            case CY_CAPSENSE_SNS_CONNECTION_HIGHZ:
                snsFuncStateSelfCap = CY_CAPSENSE_CTRLMUX_PIN_STATE_HIGH_Z;
                break;
            case CY_CAPSENSE_SNS_CONNECTION_SHIELD:
                snsFuncStateSelfCap = CY_CAPSENSE_CTRLMUX_PIN_STATE_SHIELD;
                break;
            default:
                /* No action for other connections */
                break;
        }
    #endif

    for (scanSlotIndex = 0u; scanSlotIndex < CY_CAPSENSE_SLOT_COUNT; scanSlotIndex++)
    {
        scanSlotIndexValid = scanSlotIndex + ((chId + context->ptrCommonConfig->channelOffset) * CY_CAPSENSE_SLOT_COUNT);
        (void)Cy_CapSense_GenerateSensorConfig((chId + context->ptrCommonConfig->channelOffset), scanSlotIndexValid, &sensorCfgTmp[0u], context);

        /* Does this for Control Mux connection only */
        #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
            slotValue = context->ptrScanSlots[scanSlotIndexValid].wdId;
            if (CY_CAPSENSE_SLOT_EMPTY == slotValue)
            {
                scanSlotIndexValid = (((chId + 1u) % CY_CAPSENSE_TOTAL_CH_NUMBER) * CY_CAPSENSE_SLOT_COUNT) +
                                     scanSlotIndex;
                wdIndex = context->ptrScanSlots[scanSlotIndexValid].wdId;
                widgetSenseGroup = context->ptrWdConfig[wdIndex].senseMethod;
                if (CY_CAPSENSE_CSD_GROUP == widgetSenseGroup)
                {
                    snsFuncState = snsFuncStateSelfCap;
                }
                else
                {
                    snsFuncState = snsFuncStateMutualCap;
                }
                /* INACTIVE SENSORS */
                Cy_CapSense_CalculateMaskRegisters(snsMaskInactive, snsFuncState, &sensorCfgTmp[0u]);

                #if (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE)
                    /* Set inactive ext cref pads to HIGH_Z to disconnect from sense bus */
                    if (NULL != context->ptrExtCrefPinConfig)
                    {
                        snsMask = 0u;
                        if ((chId + context->ptrCommonConfig->channelOffset) ==
                            context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF0].chId)
                        {
                            snsMask |= (uint32_t)(0x01uL << (uint32_t)context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF0].padNumber);
                        }
                        if ((chId + context->ptrCommonConfig->channelOffset) ==
                            context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF1].chId)
                        {
                            snsMask |= (uint32_t)(0x01uL << (uint32_t)context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF1].padNumber);
                        }
                        Cy_CapSense_CalculateMaskRegisters(snsMask, CY_CAPSENSE_CTRLMUX_PIN_STATE_HIGH_Z, &sensorCfgTmp[0u]);
                    }
                #endif /* (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE) */
            }
            else
            {
                if (CY_CAPSENSE_SLOT_SHIELD_ONLY <= slotValue)
                {
                    scanSlotIndexValid = ((uint32_t)context->ptrScanSlots[scanSlotIndexValid].snsId *
                                          CY_CAPSENSE_SLOT_COUNT) + scanSlotIndex;
                }

                snsIndex = context->ptrScanSlots[scanSlotIndexValid].snsId;
                wdIndex = context->ptrScanSlots[scanSlotIndexValid].wdId;
                widgetSenseGroup = context->ptrWdConfig[wdIndex].senseMethod;
                snsFuncState = snsFuncStateMutualCap;
                if (CY_CAPSENSE_CSD_GROUP == widgetSenseGroup)
                {
                    snsFuncState = snsFuncStateSelfCap;
                }
                /* INACTIVE SENSORS */
                Cy_CapSense_CalculateMaskRegisters(snsMaskInactive, snsFuncState, &sensorCfgTmp[0u]);

