zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_generator_v3.c
                /* ACTIVE SELF-CAP SENSOR */
                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
                    if (CY_CAPSENSE_SLOT_SHIELD_ONLY > slotValue)
                    {
                        /* Initializes an active sensor (including ganged sensors) by SNS, RX or TX sensor state */
                        if (CY_CAPSENSE_CSD_GROUP == widgetSenseGroup)
                        {
                            snsMask = 0u;
                            snsFuncState = CY_CAPSENSE_CTRLMUX_PIN_STATE_SNS;
                            eltdPinCfg = &context->ptrWdConfig[wdIndex].ptrEltdConfig[snsIndex];
                            /* Proceed only if electrode configuration belongs to selected channel */
                            if ((chId + context->ptrCommonConfig->channelOffset) == eltdPinCfg->chId)
                            {
                                /* Loop through all pads for this electrode (ganged sensor) */
                                for (i = 0u; i < eltdPinCfg->numPins; i++)
                                {
                                    snsMask |= 0x01uL << eltdPinCfg->ptrPin[i].padNumber;
                                }
                                Cy_CapSense_CalculateMaskRegisters(snsMask, snsFuncState, &sensorCfgTmp[0u]);
                            }
                        }
                    }
                #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */

                /* ACTIVE MUTUAL-CAP SENSOR */
                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
                    if (CY_CAPSENSE_CSX_GROUP == widgetSenseGroup)
                    {
                        if (CY_CAPSENSE_SLOT_SHIELD_ONLY > slotValue)
                        {
                            /* RX ELECTRODE */
                            snsMask = 0u;
                            snsFuncState = CY_CAPSENSE_CTRLMUX_PIN_STATE_RX;
                            i = snsIndex / context->ptrWdConfig[wdIndex].numRows;
                            eltdPinCfg = &context->ptrWdConfig[wdIndex].ptrEltdConfig[i];
                            if ((chId + context->ptrCommonConfig->channelOffset) == eltdPinCfg->chId)
                            {
                                /* Loop through all pads for this electrode (ganged sensor) */
                                for (i = 0u; i < eltdPinCfg->numPins; i++)
                                {
                                    snsMask |= 0x01uL << eltdPinCfg->ptrPin[i].padNumber;
                                }
                                Cy_CapSense_CalculateMaskRegisters(snsMask, snsFuncState, &sensorCfgTmp[0u]);
                            }
                        }

                        /* Handles multi-phase TX feature */
                        #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_MULTI_PHASE_TX_ENABLED)
                            if (context->ptrWdConfig[wdIndex].mpOrder >= CY_CAPSENSE_MPTX_MIN_ORDER)
                            {
                                /* Multiple TX ELECTRODES */
                                snsMask = 0u;
                                snsMaskNegative = 0u;
                                snsFuncState = CY_CAPSENSE_CTRLMUX_PIN_STATE_TX;
                                snsFuncStateNegative = CY_CAPSENSE_CTRLMUX_PIN_STATE_TX_NEGATIVE;
                                /* Finds the first sensor number in mptx group */
                                i = snsIndex - (snsIndex % context->ptrWdConfig[wdIndex].mpOrder);
                                /* Finds TX electrode of the first group sensor */
                                i = context->ptrWdConfig[wdIndex].numCols + (i % context->ptrWdConfig[wdIndex].numRows);
                                eltdPinCfg = &context->ptrWdConfig[wdIndex].ptrEltdConfig[i];
                                /* Finding the right vector / pattern for mptx operation */
                                pattern = context->ptrWdConfig[wdIndex].ptrMpTable->vector;
                                i = (snsIndex % context->ptrWdConfig[wdIndex].mpOrder);
                                if (0u != i)
                                {
                                    pattern = (pattern >> i) | (pattern << (context->ptrWdConfig[wdIndex].mpOrder - i));
                                }
                                if (CY_CAPSENSE_MPTX_MAX_ORDER > context->ptrWdConfig[wdIndex].mpOrder)
                                {
                                    pattern &= (0x01uL << context->ptrWdConfig[wdIndex].mpOrder) - 1u;
                                }
                                /* Loop through all involved mptx TX electrodes, positive and negative */
                                for (j = 0u; j < context->ptrWdConfig[wdIndex].mpOrder; j++)
                                {
                                    if ((chId + context->ptrCommonConfig->channelOffset) == eltdPinCfg->chId)
                                    {
                                        if (0u != (pattern & 0x01u))
                                        {
                                            /* Loop through all pads for this electrode (ganged sensor) */
                                            for (i = 0u; i < eltdPinCfg->numPins; i++)
                                            {
                                                snsMask |= 0x01uL << eltdPinCfg->ptrPin[i].padNumber;
                                            }
                                        }
                                        else
                                        {
                                            /* Loop through all pads for this electrode (ganged sensor) */
                                            for (i = 0u; i < eltdPinCfg->numPins; i++)
                                            {
                                                snsMaskNegative |= 0x01uL << eltdPinCfg->ptrPin[i].padNumber;
                                            }
                                        }
                                    }
                                    pattern >>= 0x01u;
                                    eltdPinCfg++;
                                }
                                Cy_CapSense_CalculateMaskRegisters(snsMask, snsFuncState, &sensorCfgTmp[0u]);
                                Cy_CapSense_CalculateMaskRegisters(snsMaskNegative, snsFuncStateNegative, &sensorCfgTmp[0u]);
                            }
                            else
                            {
                                /* TX ELECTRODE */
                                snsMask = 0u;
                                snsFuncState = CY_CAPSENSE_CTRLMUX_PIN_STATE_TX;
                                i = context->ptrWdConfig[wdIndex].numCols +
                                        (snsIndex % context->ptrWdConfig[wdIndex].numRows);
                                eltdPinCfg = &context->ptrWdConfig[wdIndex].ptrEltdConfig[i];
                                if ((chId + context->ptrCommonConfig->channelOffset) == eltdPinCfg->chId)
                                {
                                    /* Loop through all pads for this electrode (ganged sensor) */
                                    for (i = 0u; i < eltdPinCfg->numPins; i++)
                                    {
                                        snsMask |= 0x01uL << eltdPinCfg->ptrPin[i].padNumber;
                                    }
                                    Cy_CapSense_CalculateMaskRegisters(snsMask, snsFuncState, &sensorCfgTmp[0u]);
                                }
                            }
                        #else
                            /* TX ELECTRODE */
                            snsMask = 0u;
                            snsFuncState = CY_CAPSENSE_CTRLMUX_PIN_STATE_TX;
                            i = context->ptrWdConfig[wdIndex].numCols +
                                    (snsIndex % context->ptrWdConfig[wdIndex].numRows);
                            eltdPinCfg = &context->ptrWdConfig[wdIndex].ptrEltdConfig[i];
                            if ((chId + context->ptrCommonConfig->channelOffset) == eltdPinCfg->chId)
                            {
                                /* Loop through all pads for this electrode (ganged sensor) */
                                for (i = 0u; i < eltdPinCfg->numPins; i++)
                                {
                                    snsMask |= 0x01uL << eltdPinCfg->ptrPin[i].padNumber;
                                }
                                Cy_CapSense_CalculateMaskRegisters(snsMask, snsFuncState, &sensorCfgTmp[0u]);
                            }
                        #endif
                    }
                #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) */

                /* SHIELD ELECTRODE */
                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
                    if (0u < context->ptrCommonConfig->csdShieldNumPin)
                    {
                        snsMask = 0u;
                        /* Connect shield to CSX_ISC in CSX mode */
                        snsFuncState = (CY_CAPSENSE_CSD_GROUP == widgetSenseGroup) ?
                                        CY_CAPSENSE_CTRLMUX_PIN_STATE_SHIELD :
                                        snsFuncStateMutualCap;

                        for (i = 0u; i < context->ptrCommonConfig->csdShieldNumPin; i++)
                        {
                            if ((chId + context->ptrCommonConfig->channelOffset) == context->ptrShieldPinConfig[i].chId)
                            {
                                snsMask |= 0x01uL << context->ptrShieldPinConfig[i].padNumber;
                            }
                        }
                        Cy_CapSense_CalculateMaskRegisters(snsMask, snsFuncState, &sensorCfgTmp[0u]);
                    }
                #endif

                /* EXTERNAL CREF PADS */
                #if (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE)
                    if (NULL != context->ptrExtCrefPinConfig)
                    {
                        /* Set inactive ext cref pads to HIGH_Z to disconnect from sense bus */
                        snsMask = 0u;
                        if ((chId + context->ptrCommonConfig->channelOffset) ==
                            context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF0].chId)
                        {
                            snsMask |= (uint32_t)(0x01uL << (uint32_t)context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF0].padNumber);
                        }
                        if ((chId + context->ptrCommonConfig->channelOffset) ==
                            context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF1].chId)
                        {
                            snsMask |= (uint32_t)(0x01uL << (uint32_t)context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF1].padNumber);
                        }
                        Cy_CapSense_CalculateMaskRegisters(snsMask, CY_CAPSENSE_CTRLMUX_PIN_STATE_HIGH_Z, &sensorCfgTmp[0u]);

                        /* Override with ext cref function codes for ext-cref widget slots */
                        if ((CY_CAPSENSE_SLOT_SHIELD_ONLY > slotValue) &&
                            (CY_CAPSENSE_CREF_SOURCE_EXTERNAL == context->ptrWdConfig[wdIndex].cRefSource))
                        {
                            snsMask = 0u;
                            if ((chId + context->ptrCommonConfig->channelOffset) ==
                                context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF0].chId)
                            {
                                snsMask = (uint32_t)(0x01uL << (uint32_t)context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF0].padNumber);
                            }
                            Cy_CapSense_CalculateMaskRegisters(snsMask, CY_CAPSENSE_CTRLMUX_PIN_STATE_EXT_CREF0, &sensorCfgTmp[0u]);

                            snsMask = 0u;
                            if ((chId + context->ptrCommonConfig->channelOffset) ==
                                context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF1].chId)
                            {
                                snsMask = (uint32_t)(0x01uL << (uint32_t)context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF1].padNumber);
                            }
                            Cy_CapSense_CalculateMaskRegisters(snsMask, CY_CAPSENSE_CTRLMUX_PIN_STATE_EXT_CREF1, &sensorCfgTmp[0u]);
                        }
                    }
                #endif /* (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE) */
            }
        #endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) */

        /* Store results */
        for (i = 0u; i < CY_MSC_6_SNS_REGS; i++)
        {
            ptrSensorCfgLocal[i] = sensorCfgTmp[i];
        }
        ptrSensorCfgLocal += CY_MSC_6_SNS_REGS;
    }
}


