zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_generator_v3.c
            #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_COMP_EN) ||\
                (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_COMP_EN))
                snsCdacCtlReg |= ((uint32_t)ptrSnsCxt->cdacComp) << MSC_SNS_CDAC_CTL_SEL_CO_Pos;
                break;
            #endif

            default:
                /* Do nothing */
                break;
            }
        }
    #endif

    ptrSensorCfg[CY_CAPSENSE_SNS_CDAC_CTL_INDEX] = snsCdacCtlReg;

    return capStatus;
}


#if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
/*******************************************************************************
* Function Name: Cy_CapSense_GenerateCtrlMuxSwControl
****************************************************************************//**
*
* Generates the Control MUX Switch Control register configuration.
*
* \param chIndex
* The desired channel index.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_GenerateCtrlMuxSwControl(
                uint32_t chIndex,
                cy_stc_capsense_context_t * context)
{
    uint32_t cswFuncMode = 0uL;
    uint32_t i;
    const cy_stc_capsense_pin_config_t * ptrPinCfg = context->ptrPinConfig;

    for (i = 0u; i < context->ptrCommonConfig->numPin; i++)
    {
        if ((chIndex + context->ptrCommonConfig->channelOffset) == ptrPinCfg->chId)
        {
            cswFuncMode |= (0x01uL << ptrPinCfg->padNumber);
        }
        ptrPinCfg++;
    }

    ptrPinCfg = context->ptrShieldPinConfig;
    for (i = 0u; i < context->ptrCommonConfig->csdShieldNumPin; i++)
    {
        if ((chIndex + context->ptrCommonConfig->channelOffset) == ptrPinCfg->chId)
        {
            cswFuncMode |= (0x01uL << ptrPinCfg->padNumber);
        }
        ptrPinCfg++;
    }

    #if (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE)
        if (NULL != context->ptrExtCrefPinConfig)
        {
            if ((chIndex + context->ptrCommonConfig->channelOffset) ==
                context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF0].chId)
            {
                cswFuncMode |= (uint32_t)(0x01uL << (uint32_t)context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF0].padNumber);
            }
            if ((chIndex + context->ptrCommonConfig->channelOffset) ==
                context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF1].chId)
            {
                cswFuncMode |= (uint32_t)(0x01uL << (uint32_t)context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF1].padNumber);
            }
        }
    #endif /* (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE) */

    context->ptrBaseFrameContext[chIndex].cswCtl = cswFuncMode;
}
#endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_ApplyShieldConfig
****************************************************************************//**
*
* Applies shield configuration to the base configuration.
*
* \param ptrBaseCfgMode
* Specifies the pointer to the sense mode registers structure
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_ApplyShieldConfig(
                cy_stc_msc_mode_config_t * ptrBaseCfgMode,
                const cy_stc_capsense_context_t * context)
{
    ptrBaseCfgMode->senseDutyCtl &= ~(MSC_MODE_SENSE_DUTY_CTL_PHASE_GAP_FS2_PH0_EN_Msk |
                                      MSC_MODE_SENSE_DUTY_CTL_PHASE_GAP_FS2_PH1_EN_Msk);
    /* Active Shield mode */
    if (CY_CAPSENSE_SHIELD_ACTIVE == context->ptrCommonConfig->csdShieldMode)
    {
        #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
            ptrBaseCfgMode->swSelTop &= ~CY_CAPSENSE_FW_SHIELD_ACTIVE_CTRLMUX_REG_SW_SEL_TOP_MASK;
            ptrBaseCfgMode->swSelTop |= CY_CAPSENSE_FW_SHIELD_ACTIVE_CTRLMUX_REG_SW_SEL_TOP_VALUE;
            ptrBaseCfgMode->swSelSh  |= CY_CAPSENSE_FW_SHIELD_ACTIVE_CTRLMUX_REG_SW_SEL_SH_VALUE;

        #else /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD) */
            /* Amux sensor_connection_method */
            ptrBaseCfgMode->swSelTop &= ~CY_CAPSENSE_FW_SHIELD_ACTIVE_AMUX_REG_SW_SEL_TOP_MASK;
            ptrBaseCfgMode->swSelTop |= CY_CAPSENSE_FW_SHIELD_ACTIVE_AMUX_REG_SW_SEL_TOP_VALUE;
            ptrBaseCfgMode->swSelSh  |= CY_CAPSENSE_FW_SHIELD_ACTIVE_AMUX_REG_SW_SEL_SH_VALUE;
        #endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) */
    }
    /* Passive Shield mode */
    else
    {
        #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
            ptrBaseCfgMode->swSelTop &= ~CY_CAPSENSE_FW_SHIELD_PASSIVE_CTRLMUX_REG_SW_SEL_TOP_MASK;
            ptrBaseCfgMode->swSelTop |= CY_CAPSENSE_FW_SHIELD_PASSIVE_CTRLMUX_REG_SW_SEL_TOP_VALUE;
            ptrBaseCfgMode->senseDutyCtl |= ((1u << MSC_MODE_SENSE_DUTY_CTL_PHASE_GAP_FS2_PH0_EN_Pos) |
                                             (1u << MSC_MODE_SENSE_DUTY_CTL_PHASE_GAP_FS2_PH1_EN_Pos));
        #endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) */
    }
}
#endif

/*******************************************************************************
* Function Name: Cy_CapSense_ConfigSensorClock
****************************************************************************//**
*
* This function configures the sense clock for different modes.
*
* \param scanSlot
* Slot to scan
*
* \param ptrSensorCfg
* Specifies the pointer to the sensor configuration to be filled.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_ConfigSensorClock(
                uint32_t scanSlot,
                uint32_t * ptrSensorCfg,
                const cy_stc_capsense_context_t * context)
{
    uint8_t lfsrBitsVal;
    uint8_t lfsrModeVal;
    uint16_t snsClkDividerVal;

    uint32_t wdIndex = context->ptrScanSlots[scanSlot].wdId;
    const cy_stc_capsense_widget_context_t * ptrWdCxt = &context->ptrWdContext[wdIndex];
    const cy_stc_capsense_widget_config_t * ptrWdCfg = &context->ptrWdConfig[wdIndex];

    ptrSensorCfg[CY_CAPSENSE_SNS_CTL_INDEX] &= ~(MSC_SNS_CTL_SENSE_DIV_Msk |
                                                 MSC_SNS_CTL_LFSR_MODE_Msk |
                                                 MSC_SNS_CTL_LFSR_BITS_Msk);

    /* Getting column sense clock divider */
    snsClkDividerVal = ptrWdCxt->snsClk;
    if ((CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod) &&
        (ptrWdCfg->numCols <= context->ptrScanSlots[scanSlot].snsId))
    {
        snsClkDividerVal = ptrWdCxt->rowSnsClk;
    }

