zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_generator_v3.c
    snsClkDividerVal = (uint16_t)Cy_CapSense_AdjustSnsClkDivider(ptrWdCfg->senseMethod,
                                                ptrWdCxt->snsClkSource, snsClkDividerVal);

    snsClkDividerVal -= 1u;
    lfsrBitsVal = (ptrWdCxt->lfsrBits & CY_CAPSENSE_LFSR_BITS_RANGE_MASK);
    lfsrModeVal = (ptrWdCxt->snsClkSource & CY_CAPSENSE_CLK_SOURCE_MASK);

    ptrSensorCfg[CY_CAPSENSE_SNS_CTL_INDEX] |= (((uint32_t)snsClkDividerVal) << MSC_SNS_CTL_SENSE_DIV_Pos) |
                                                ((uint32_t)lfsrModeVal << MSC_SNS_CTL_LFSR_MODE_Pos) |
                                                ((uint32_t)lfsrBitsVal << MSC_SNS_CTL_LFSR_BITS_Pos);
}


/*******************************************************************************
* Function Name: Cy_CapSense_AdjustSnsClkDivider
****************************************************************************//**
*
* If the PRS is selected as the Sense Clock source, adjusts the Sense Clock
* divider to obtain the max frequency of the PRS sequence equal to
* ModClkFreq / SenseClkDivider. Updates the sense Clock divider with the minimal
* supported value in case if it is out of range for the specified parameters.
*
* \param snsMethod
*  Specifies the widget group:
*   - CSD (CY_CAPSENSE_CSD_GROUP)
*   - CSX (CY_CAPSENSE_CSX_GROUP)
*
* \param snsClkSource
*  Specifies the sense Clock source, supported by MSCv3 HW:
*   - CY_CAPSENSE_CLK_SOURCE_DIRECT
*   - CY_CAPSENSE_CLK_SOURCE_SSC
*   - CY_CAPSENSE_CLK_SOURCE_PRS
*
* \param snsClkDivider
* The divider value for the sense clock.
*
* \return
*  Adjusted value of the Sense Clock divider.
*
*******************************************************************************/
uint32_t Cy_CapSense_AdjustSnsClkDivider(
                        uint8_t snsMethod,
                        uint8_t snsClkSource,
                        uint16_t snsClkDivider)
{
    uint16_t snsClkDividerTmp;
    uint32_t snsClkDividerShift;
    uint32_t snsClkSourceTmp;

    snsClkDividerTmp = snsClkDivider;
    snsClkSourceTmp = ((uint32_t)snsClkSource & CY_CAPSENSE_CLK_SOURCE_MASK);

    if (CY_CAPSENSE_CSD_GROUP == snsMethod)
    {
        snsClkDividerShift = CY_CAPSENSE_4PH_PRS_SNS_CLOCK_DIVIDER_SHIFT;
    }
    else
    {
        snsClkDividerShift = CY_CAPSENSE_2PH_PRS_SNS_CLOCK_DIVIDER_SHIFT;
    }

    if (CY_CAPSENSE_CLK_SOURCE_PRS == snsClkSourceTmp)
    {
        snsClkDividerTmp >>= snsClkDividerShift;
    }

    return snsClkDividerTmp;
}


#endif /* CY_IP_M0S8MSCV3 */


/* [] END OF FILE */
